app/controllers/photos_controller.rb

SELECT `photos`.* FROM `photos`
---
  def index
    @photos = Photo.all

INSERT INTO `photos` (`created_at`, `file_content_type`, `file_file_name`, `file_file_size`, `file_updated_at`, `latitude`, `longitude`, `updated_at`) VALUES ('2014-08-28 07:42:30', 'image/jpeg', 'DSC_0019.jpg', 608007, '2014-08-28 07:42:29', 0.0, 0.0, '2014-08-28 07:42:30')
---
  def create
    #puts "avant"
    #puts params[:photo][:file].inspect
    #puts "apres"
    #puts EXIFR::JPEG.new(params[:photo][:file].queued_for_write[:original]).width
    puts photo_params.inspect
    @photo = Photo.new(photo_params)
    #puts "largeur"
    #puts EXIFR::JPEG.new(params[:photo][:file].queued_for_write[:original]).width

#puts "date"
#puts @photo.file.date
    respond_to do |format|
      if @photo.save

SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 1 LIMIT 1
---
    def set_photo
      @photo = Photo.find(params[:id])